/*******************************蜂鸣器引脚定义*********************************/
#define Buz_DIR P2DIR
#define Buz_OUT P2OUT
#define Buz_Pin BIT7
#define BUZ_ON TACTL |= TASSEL_2 + ID_3 +MC_1
#define BUZ_OFF TACTL |= TASSEL_2 + ID_3 +MC_0

/******************************************************************************/
/*******************************************************************************
*函数名称：init_BUZ
*函数功能：初始化蜂鸣器，其实是TA的初始化
*说明：TA驱动蜂鸣器，频率在2700hz左右
*******************************************************************************/
void init_BUZ()
{
    TACCTL0 |= CCIE;                    //使能比较中断
    TACTL |= TASSEL_2 + ID_3 +MC_1;          //计数时钟选择SMLK=8MHz，1/8分频后为1MHz
    TACCR0 = 180;
    Buz_DIR |= Buz_Pin;
    
}
/*******************************************************************************
*函数名称：Timer_A
*函数功能：蜂鸣器叫呀叫
*说明：定时器中断，用于产生无源蜂鸣器所需方波
*******************************************************************************/
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{
  Buz_OUT ^= Buz_Pin;
}